#include "main.h"
#include "Gpio.h"
void Gpio_init(void){
		P0M0 = 0x00;                                //设置P0.0~P0.7为双向口模式
    P0M1 = 0x00;

    P1M0 = 0xff;                                //设置P1.0~P1.7为推挽输出模式
    P1M1 = 0x00;
//    P1M0 = 0xf0;                                //设置P1.4~P1.7为推挽输出模式，设置P1.0~P0.3为双向口模式
//    P1M1 = 0x00;

    P2M0 = 0x00;                                //设置P2.0~P2.7为高阻输入模式
    P2M1 = 0xff;
//    P2M0 = 0x00;                                //设置P2.0~P2.3为高阻输入模式，设置P2.4~P2.7为双向口模式
//    P2M1 = 0x0f;

    P3M0 = 0xff;                                //设置P3.0~P3.7为开漏模式
    P3M1 = 0xff;
//    P3M0 = 0x0f;                                //设置P3.0~P3.3为开漏模式，设置P3.4~P3.7为高阻输入模式
//    P3M1 = 0xff;
}	